Repository: kononenkoAnton/FeaturesApp
Catalog: CountryCodeExample/Resources/TMDBNetworkErrors.xcstrings
Source language: en
Languages: es, uk

# account_disabled
source: Account disabled: Your account is no longer active. Contact TMDB if this is an error.
es: Cuenta deshabilitada: Tu cuenta ya no está activa. Contacta a TMDB si esto es un error.
uk: Обліковий запис вимкнено: Ваш обліковий запис більше не активний. Зверніться до TMDB, якщо це помилка.

# api_maintenance
source: The API is undergoing maintenance. Try again later.
es: La API está en mantenimiento. Inténtalo de nuevo más tarde.
uk: API проходить технічне обслуговування. Спробуйте пізніше.

# authentication_failed
source: Authentication failed: You do not have permissions to access the service.
es: Autenticación fallida: No tienes permisos para acceder al servicio.
uk: Аутентифікація не вдалася: У вас немає дозволу на доступ до сервісу.

# authentication_failed_again
source: Authentication failed.
es: Autenticación fallida.
uk: Аутентифікація не вдалася.

# backend_server_unavailable
source: Couldn't connect to the backend server.
es: No se pudo conectar al servidor backend.
uk: Не вдалося підключитися до серверу.

# confirmation_required
source: You must confirm this action: Please provide a confirm=true parameter.
es: Debes confirmar esta acción: Por favor proporciona un parámetro confirm=true.
uk: Ви повинні підтвердити цю дію: Будь ласка, надайте параметр confirm=true.

source: Device denied.
es: Dispositivo denegado.
uk: Пристрій відхилено.

# duplicate_entry
source: Duplicate entry: The data you tried to submit already exists.
es: Entrada duplicada: Los datos que intentaste enviar уже existen.
uk: Дубльована запис: Дані, які ви намагалися відправити, вже існують.

# email_not_verified
source: Email not verified: Your email address has not been verified.
es: Correo electrónico no verificado: Tu dirección de correo electrónico no ha sido verificada.
uk: Електронну пошту не перевірено: Ваша електронна адреса не була перевірена.

# entry_not_found
source: Entry not found: The item you are trying to edit cannot be found.
es: Entrada no encontrada: El elemento que intentas editar no se puede encontrar.
uk: Запис не знайдено: Елемент, який ви намагаєтеся редагувати, не знайдено.

source: Failed.
es: Fallido.
uk: Не вдалося.

# internal_error
source: Internal error: Something went wrong, contact TMDB.
es: Error interno: Algo salió mal, contacta a TMDB.
uk: Внутрішня помилка: Щось пішло не так, зверніться до TMDB.

source: Invalid accept header.
es: Encabezado de aceptación inválido.
uk: Неправильний заголовок accept.

# invalid_api_key
source: Invalid API key: You must be granted a valid key.
es: Clave de API inválida: Debes tener una clave válida.
uk: Неправильний API ключ: Ви повинні мати дійсний ключ.

# invalid_credentials
source: Invalid username and/or password: You did not provide a valid login.
es: Nombre de usuario y/o contraseña inválidos: No proporcionaste un inicio de sesión válido.
uk: Неправильне ім'я користувача та/або пароль: Ви не надали дійсний логін.

# invalid_date
source: Invalid date: Format needs to be YYYY-MM-DD.
es: Fecha inválida: El formato debe ser YYYY-MM-DD.
uk: Неправильна дата: Формат повинен бути YYYY-MM-DD.

# invalid_date_range
source: Invalid date range: Should be a range no longer than 14 days.
es: Rango de fechas inválido: Debe ser un rango de no más de 14 días.
uk: Неправильний діапазон дат: Повинен бути діапазон не довший за 14 днів.

# invalid_format
source: Invalid format: This service doesn't exist in that format.
es: Formato inválido: Este servicio no existe en ese formato.
uk: Неправильний формат: Цей сервіс не існує в цьому форматі.

# invalid_id
source: Invalid id: The pre-requisite id is invalid or not found.
es: ID inválido: El id pre-requisito es inválido o no se encontró.
uk: Неправильний ID: Попередній ID недійсний або не знайдено.

# invalid_id_error
source: The ID is invalid.
es: El ID es inválido.
uk: ID недійсний.

# invalid_input
source: The input is not valid.
es: La entrada no es válida.
uk: Вхідні дані недійсні.

# invalid_page
source: Invalid page: Pages start at 1 and max at 500. They are expected to be an integer.
es: Página inválida: Las páginas comienzan en 1 y el máximo es 500. Se espera que sean un número entero.
uk: Неправильна сторінка: Сторінки починаються з 1 і мають максимум 500. Вони повинні бути цілим числом.

# invalid_parameters
source: Invalid parameters: Your request parameters are incorrect.
es: Parámetros inválidos: Los parámetros de tu solicitud son incorrectos.
uk: Неправильні параметри: Параметри вашого запиту некоректні.

# invalid_request_token
source: Invalid request token: The request token is either expired or invalid.
es: Token de solicitud inválido: El token de solicitud ha expirado o es inválido.
uk: Неправильний токен запиту: Токен запиту або прострочений, або недійсний.

# invalid_service
source: Invalid service: this service does not exist.
es: Servicio inválido: este servicio no existe.
uk: Неправильний сервіс: цей сервіс не існує.

# invalid_timezone
source: Invalid timezone: Please consult the documentation for a valid timezone.
es: Zona horaria inválida: Por favor consulta la documentación para una zona horaria válida.
uk: Неправильний часовий пояс: Будь ласка, перегляньте документацію для дійсного часового поясу.

source: Invalid token.
es: Token inválido.
uk: Неправильний токен.

# method_not_supported
source: This request method is not supported for this resource.
es: Este método de solicitud no es compatible con este recurso.
uk: Цей метод запиту не підтримується для цього ресурсу.

source: Nothing to update.
es: Nada que actualizar.
uk: Немає чого оновлювати.

# permission_denied
source: You don't have permission to edit this resource.
es: No tienes permiso para editar este recurso.
uk: У вас немає дозволу на редагування цього ресурсу.

# record_deleted
source: The item/record was deleted successfully.
es: El elemento/registro se eliminó correctamente.
uk: Елемент/запис було успішно видалено.

# record_updated
source: The item/record was updated successfully.
es: El elemento/registro se actualizó correctamente.
uk: Елемент/запис було успішно оновлено.

# request_limit_exceeded
source: Your request count is over the allowed limit.
es: Tu número de solicitudes supera el límite permitido.
uk: Кількість ваших запитів перевищує дозволений ліміт.

# request_timeout
source: Your request to the backend server timed out. Try again.
es: Tu solicitud al servidor backend agotó el tiempo. Inténtalo de nuevo.
uk: Ваш запит до серверу з часом вийшов. Спробуйте знову.

# resource_not_found
source: The resource you requested could not be found.
es: El recurso que solicitaste no pudo ser encontrado.
uk: Ресурс, який ви запитували, не було знайдено.

# resource_private
source: This resource is private.
es: Este recurso es privado.
uk: Цей ресурс є приватним.

# service_offline
source: Service offline: This service is temporarily offline, try again later.
es: Servicio fuera de línea: Este servicio está temporalmente fuera de línea, inténtalo de nuevo más tarde.
uk: Сервіс офлайн: Цей сервіс тимчасово недоступний, спробуйте пізніше.

source: Session denied.
es: Sesión denegada.
uk: Сесія відхилена.

# session_not_found
source: The requested session could not be found.
es: La sesión solicitada no pudo ser encontrada.
uk: Запитану сесію не вдалося знайти.

source: Success.
es: Éxito.
uk: Успіх.

# suspended_api_key
source: Suspended API key: Access to your account has been suspended, contact TMDB.
es: Clave de API suspendida: El acceso a tu cuenta ha sido suspendido, contacta a TMDB.
uk: Призупинений API ключ: Доступ до вашого облікового запису було призупинено, зверніться до TMDB.

# token_not_approved
source: This request token hasn't been approved by the user.
es: Este token de solicitud no ha sido aprobado por el usuario.
uk: Цей токен запиту не був схвалений користувачем.

# token_write_permission_denied
source: This token hasn't been granted write permission by the user.
es: Este token no ha sido concedido con permiso de escritura por el usuario.
uk: Цьому токену не надано права запису користувачем.

# too_many_append_to_response_objects
source: Too many append to response objects: The maximum number of remote calls is 20.
es: Demasiados objetos append a la respuesta: El número máximo de llamadas remotas es 20.
uk: Занадто багато об'єктів append до відповіді: Максимальна кількість віддалених викликів - 20.

# user_suspended
source: This user has been suspended.
es: Este usuario ha sido suspendido.
uk: Цей користувач було призупинено.

# username_password_required
source: You must provide a username and password.
es: Debes proporcionar un nombre de usuario y contraseña.
uk: Ви повинні вказати ім'я користувача та пароль.

source: Validation failed.
es: Validación fallida.
uk: Перевірка не вдалася.
